#include "s21_graph_algorithms.h"

/*
 * Функция для нерекурентного поиска в глубину в графе от заданной вершины
 *
 *
 * Возвращает массив, содержащий в себе обойдённые вершины в порядке их обхода.
 * При реализации этой функции обязательно использовать
 * самописную структуру данных стек, которую предварительно
 * стоит оформить в виде отдельной статической библиотеки
 */
std::vector<int> GraphAlgorithms::DepthFirstSearch(int &graph, int startVertex)
{
}








/*
 * Функция для поиска в ширину в графе от заданной вершины
 *
 *
 * Возвращает массив, содержащий в себе обойдённые вершины в порядке их обхода.
 * При реализации этой функции обязательно использовать
 * самописную структуру данных очередь, которую предварительно
 * стоит оформить в виде отдельной статической библиотеки
 */
std::vector<int> GraphAlgorithms::BreadthFirstSearch(int &graph, int startVertex)
{
}